__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input (InputLayer)              (None, 8)            0
__________________________________________________________________________________________________
dense_0 (Dense)                 (None, 512)          4608        input[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          262656      dense_0[0][0]
__________________________________________________________________________________________________
v (Dense)                       (None, 1)            513         dense_1[0][0]
__________________________________________________________________________________________________
a (Dense)                       (None, 4)            2052        dense_1[0][0]
__________________________________________________________________________________________________
q (Lambda)                      (None, 4)            0           v[0][0]
                                                                 a[0][0]
==================================================================================================
Total params: 269,829
Trainable params: 269,829
Non-trainable params: 0
__________________________________________________________________________________________________
None
Agent parameters:
{'env': <TimeLimit<LunarLander<LunarLander-v2>>>, 'gamma': 0.99, 'alpha': 0.0005, 'memory': deque([], maxlen=10000), 'batch_size': 32, 'Q': <keras.engine.training.Model object at 0xb2b517b00>, 'Q_target': <keras.engine.training.Model object at 0xb2b609cf8>, 'double': True, 'tau': 1.0, 'epsilon': 1.0, 'min_epsilon': 0.05}


def epsilon_decay2(curr_epsilon, i_episode, min_epsilon=0.05):
        return max(min_epsilon, np.exp(-i_episode / 70))