{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "dense_0", "class_name": "Dense", "config": {"name": "dense_0", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_0", 0, 0, {}]]]}, {"name": "v", "class_name": "Dense", "config": {"name": "v", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "a", "class_name": "Dense", "config": {"name": "a", "trainable": true, "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "q", "class_name": "Lambda", "config": {"name": "q", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcx4AAAB8AGQBGQB8AGQCGQB0AGoBfABkAhkAgwEYABcAUwAp\nA07pAAAAAOkBAAAAKQLaAUvaBG1lYW4pAdoBeKkAcgYAAAD6PS9Vc2Vycy9jYXJsb3Nzb3V6YS9E\ncm9wYm94L09NU0NTLzIwMTkvUkxETS9wcm9qZWN0XzIvYWdlbnQucHnaCDxsYW1iZGE+NAAAAHMA\nAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["v", 0, 0, {}], ["a", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["q", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}